In [1]:
import pandas as pd
import numpy as np

In [5]:
dicc ={
'Col1':[1 ,2, 3, np.nan],
'Col2':[4, np.nan, 5, 6],
'Col3':['a', 'b', 'c', None]}

In [6]:
df = pd.DataFrame(dicc)

In [7]:
df

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   NaN     b
2   3.0   5.0     c
3   NaN   6.0  None

In [8]:
# Ciertos valores son null/incompletos

df.isnull() # define como True cuando un valor es tomado como null

    Col1   Col2   Col3
0  False  False  False
1  False   True  False
2  False  False  False
3   True  False   True

In [9]:
# generar la misma tabla pero 1 si null 0 si no
df.isnull()*1

   Col1  Col2  Col3
0     0     0     0
1     0     1     0
2     0     0     0
3     1     0     1

In [10]:
df.fillna('Missing') # rellena como missing el valor null

      Col1     Col2     Col3
0      1.0      4.0        a
1      2.0  Missing        b
2      3.0      5.0        c
3  Missing      6.0  Missing

In [15]:
df.fillna(df['Col1'].mean()) # rellena con la media si se puede, con string no podr√°, se puede usar otro que no sea mean

   Col1  Col2 Col3
0   1.0   4.0    a
1   2.0   2.0    b
2   3.0   5.0    c
3   2.0   6.0  2.0

In [16]:
df.interpolate()  # esto asume que esta trabjando con series numerica

/tmp/ipykernel_1795/2777592621.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate()  # esto asume que esta trabjando con series numerica

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   4.5     b
2   3.0   5.0     c
3   3.0   6.0  None

In [ ]:
# no afecta a los str

In [17]:
df.dropna()  # borrado los registros que contengan los valores nulos

   Col1  Col2 Col3
0   1.0   4.0    a
2   3.0   5.0    c